<?php
function to_latin($s)
{
   $s = preg_replace("/\s+/", ' ', $s);
   $s = trim($s);

   $s = strtr(
      $s,
      array(
         'а' => 'a', 'б' => 'b', 'в' => 'v',
         'г' => 'g', 'д' => 'd', 'е' => 'e',
         ' е' => ' ye',
         'ё' => 'yo', 'ж' => 'j', 'з' => 'z',
         'и' => 'i', 'й' => 'y', 'к' => 'k',
         'л' => 'l', 'м' => 'm', 'н' => 'n',
         'о' => 'o', 'п' => 'p', 'р' => 'r',
         'с' => 's', 'т' => 't', 'у' => 'u',
         'ф' => 'f', 'х' => 'x', 'ц' => 'ts',
         'ч' => 'ch', 'ш' => 'sh', 'щ' => 'sh',
         'ы' => 'y', 'э' => 'e', 'ю' => 'yu',
         'я' => 'ya', 'ъ' => '\'', 'ь' => '',
         'қ' => 'q', 'ҳ' => 'h', 'ў' => 'o\‘', 'ғ' => 'g\'',
      )
   );

   $s = strtr(
      $s,
      array(
         'А' => 'A', 'Б' => 'B', 'В' => 'V',
         'Г' => 'G', 'Д' => 'D', 'Е' => 'E', ' Е' => ' Ye',
         'Ё' => 'Yo', 'Ж' => 'J', 'З' => 'Z',
         'И' => 'I', 'Й' => 'Y', 'К' => 'K',
         'Л' => 'L', 'М' => 'M', 'Н' => 'N',
         'О' => 'O', 'П' => 'P', 'Р' => 'R',
         'С' => 'S', 'Т' => 'T', 'У' => 'U',
         'Ф' => 'F', 'Х' => 'X', 'Ц' => 'Ts',
         'Ч' => 'Ch', 'Ш' => 'Sh', 'Щ' => 'Sh',
         'Ы' => 'Y', 'Э' => 'E', 'Ю' => 'Yu',
         'Я' => 'Ya', 'Ъ' => '\'', 'Ь' => '',
         'Қ' => 'Q', 'Ҳ' => 'H', 'Ў' => 'O\‘', 'Ғ' => 'G\‘',
      )
   );
   $s = preg_replace("/[^0-9a-z\-_\.\'\‘ ]/i", "", $s);
   $s = str_replace(" ", " ", $s);
   return $s;
}


function to_cyrillic($s)
{
   $latin = array(' ye', ' Ye', ' e', ' E', 'ts', 'Ts', 'yo', 'Yo', 'yu', 'Yu', 'ya', 'Ya', 'sh', 'ch', 'Sh', 'Ch', 'o‘', 'g‘', 'o\'', 'g\'', 'O‘', 'G‘', 'O\'', 'G\'', 'a', 'b', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v',  'x', 'y', 'z', '’', '\'', 'A', 'B', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'X', 'Y', 'Z');
   
   $cyrillic = array(' е', ' Е', ' э', ' Э', 'ц', 'Ц', 'ё', 'Ё', 'ю', 'Ю', 'я', 'Я', 'ш', 'ч', 'Ш', 'Ч', 'ў', 'ғ', 'ў', 'ғ', 'Ў', 'Ғ', 'Ў', 'Ғ', 'а', 'б', 'д', 'е', 'ф', 'г', 'х', 'и', 'ж', 'к', 'л', 'м', 'н', 'о', 'п', 'қ', 'р', 'с', 'т', 'у', 'в',  'х', 'й', 'з',  'ъ', 'ъ', 'А', 'Б', 'Д', 'Е', 'Ф', 'Г', 'Ҳ', 'И', 'Ж', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Қ', 'Р', 'С', 'Т', 'У', 'В',  'Х', 'Й', 'З');

   return str_replace($latin, $cyrillic, $s);
}
